{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"embedding_1_input": {"name": "embedding_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "50000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "50000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50000"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "embedding_1_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_192", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9mb3J3YXJkX2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_193", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9mb3J3YXJkX2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_194", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9mb3J3YXJkX2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_186", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9mb3J3YXJkX2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_184", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9mb3J3YXJkX2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_252", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9iYWNrd2FyZF9sc3RtXzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_253", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9iYWNrd2FyZF9sc3RtXzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_254", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9iYWNrd2FyZF9sc3RtXzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_246", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9iYWNrd2FyZF9sc3RtXzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_72", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9mb3J3YXJkX2xzdG1fMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_73", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9mb3J3YXJkX2xzdG1fMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_74", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9mb3J3YXJkX2xzdG1fMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_66", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9mb3J3YXJkX2xzdG1fMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_64", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9mb3J3YXJkX2xzdG1fMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_132", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9iYWNrd2FyZF9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_133", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9iYWNrd2FyZF9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_134", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9iYWNrd2FyZF9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_126", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9iYWNrd2FyZF9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_124", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9iYWNrd2FyZF9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_244", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMy9iYWNrd2FyZF9sc3RtXzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/Cast", "op": "Cast", "input": ["embedding_1_input"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/merge/_203", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_192", "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/next_iteration/_239"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/merge/_204", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_193", "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/next_iteration/_240"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/merge/_205", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_194", "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/next_iteration/_241"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/merge/_197", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_186", "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/next_iteration/_233"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/merge/_195", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/enter/_184", "StatefulPartitionedCall/sequential_1/bidirectional_3/forward_lstm_3/PartitionedCall/while/next_iteration/_231"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/merge/_263", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_252", "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/next_iteration/_299"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/merge/_264", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_253", "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/next_iteration/_300"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/merge/_265", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_254", "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/next_iteration/_301"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/merge/_257", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_246", "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/next_iteration/_293"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/merge/_83", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_72", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/next_iteration/_119"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/merge/_84", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_73", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/next_iteration/_120"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/merge/_85", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_74", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/next_iteration/_121"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/merge/_77", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_66", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/next_iteration/_113"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/merge/_75", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_64", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/next_iteration/_111"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/merge/_143", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_132", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/next_iteration/_179"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/merge/_144", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_133", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/next_iteration/_180"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/merge/_145", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_134", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/next_iteration/_181"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/merge/_137", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_126", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/next_iteration/_173"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/merge/_135", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/enter/_124", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/while/next_iteration/_171"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/merge/_255", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/enter/_244", "StatefulPartitionedCall/sequential_1/bidirectional_3/backward_lstm_3/PartitionedCall/while/next_iteration/_291"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential_1/embedding_1/Cast", "StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/while/enter/_71", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMi9mb3J3YXJkX2xzdG1fMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_2/forward_lstm_2/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/ReverseV2", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_2/backward_lstm_2/PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": 