{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"embedding_2_input": {"name": "embedding_2_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}, "outputs": {"dense_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "50000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "50000"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50000"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/embedding_2/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "embedding_2_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_192", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9mb3J3YXJkX2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_193", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9mb3J3YXJkX2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_194", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9mb3J3YXJkX2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_186", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9mb3J3YXJkX2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_184", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9mb3J3YXJkX2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_252", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9iYWNrd2FyZF9sc3RtXzUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_253", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9iYWNrd2FyZF9sc3RtXzUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_254", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9iYWNrd2FyZF9sc3RtXzUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_246", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9iYWNrd2FyZF9sc3RtXzUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_72", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9mb3J3YXJkX2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_73", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9mb3J3YXJkX2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_74", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9mb3J3YXJkX2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_66", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9mb3J3YXJkX2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_64", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9mb3J3YXJkX2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_132", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9iYWNrd2FyZF9sc3RtXzQvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_133", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9iYWNrd2FyZF9sc3RtXzQvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_134", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9iYWNrd2FyZF9sc3RtXzQvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_126", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9iYWNrd2FyZF9sc3RtXzQvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_124", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9iYWNrd2FyZF9sc3RtXzQvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_244", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNS9iYWNrd2FyZF9sc3RtXzUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/embedding_2/Cast", "op": "Cast", "input": ["embedding_2_input"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/merge/_203", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_192", "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/next_iteration/_239"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/merge/_204", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_193", "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/next_iteration/_240"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/merge/_205", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_194", "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/next_iteration/_241"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/merge/_197", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_186", "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/next_iteration/_233"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/merge/_195", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/enter/_184", "StatefulPartitionedCall/sequential_2/bidirectional_5/forward_lstm_5/PartitionedCall/while/next_iteration/_231"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/merge/_263", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_252", "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/next_iteration/_299"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/merge/_264", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_253", "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/next_iteration/_300"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/merge/_265", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_254", "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/next_iteration/_301"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/merge/_257", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_246", "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/next_iteration/_293"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/merge/_83", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_72", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/next_iteration/_119"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/merge/_84", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_73", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/next_iteration/_120"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/merge/_85", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_74", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/next_iteration/_121"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/merge/_77", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_66", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/next_iteration/_113"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/merge/_75", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_64", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/next_iteration/_111"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/merge/_143", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_132", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/next_iteration/_179"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/merge/_144", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_133", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/next_iteration/_180"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/merge/_145", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_134", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/next_iteration/_181"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/merge/_137", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_126", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/next_iteration/_173"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/merge/_135", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/enter/_124", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/while/next_iteration/_171"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/merge/_255", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/enter/_244", "StatefulPartitionedCall/sequential_2/bidirectional_5/backward_lstm_5/PartitionedCall/while/next_iteration/_291"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/embedding_2/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential_2/embedding_2/Cast", "StatefulPartitionedCall/sequential_2/embedding_2/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/embedding_2/embedding_lookup"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/embedding_2/embedding_lookup", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/embedding_2/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/embedding_2/embedding_lookup", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/Shape", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice/stack", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/Shape", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice/stack", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/while/enter/_71", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2JpZGlyZWN0aW9uYWxfNC9mb3J3YXJkX2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/bidirectional_4/forward_lstm_4/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/ReverseV2", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/bidirectional_4/backward_lstm_4/PartitionedCall/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, 